//==========================================================================
//      版权:ZTYQ Tech. Co., Ltd.//版权
//      工程名: GeoStatGraph。
//      作者: lhy，2007.12
//      功能描述: 各种统计图的绘制功能
//      版本:  1.1，2007.12。
//      修改记录:  无。
//      主要函数列表: 
//      _gsCreateGsGraphObj ----------------------------------->创建绘图对象
//      _gsGraphDrawHistPlt ------------------------------------->绘制直方图
//      _gsGraphDrawPropPlt ------------------------------------->绘制概率图
//      _gsGraphDrawScatPlt ------------------------------------->绘制散点图
//      _gsGraphDrawQqppPlt ------------------------------------->绘制QQPP图
//      _gsGraphDrawNqqpPlt --------------------------------->绘制正态QQPP图
//      _gsGraphDrawLocmPlt ------------------------------------->绘制位置图
//      _gsGraphDrawVarmPlt --------------------------------->绘制变差函数图
//      _gsGraphDrawMVarmPlt ---------------------------->绘制多个变差函数图
//      _gsGraphDrawCrosPlt --------------------------------->绘制交叉验证图
//      _gsTranNcore ------------------------------------>对数据进行正态变换
//      _gsTranLog -------------------------------------->对数据进行对数变换
//      _gsCptVModel ------------------------------------>计算理论变差函数点
//==========================================================================

#ifndef _GEOSTAT_GRAPH_H
#define _GEOSTAT_GRAPH_H

#include "gsstru.h"
#include "GeoStatLib.h"

typedef class CGeoStatGraph*		GeoStatGraphObj;	//地质统计库对象

//地质统计绘图库对象类型
#define		GEOGRAPH_BASE_OBJ		0	//绘图对象
#define		GEOGRAPH_HIST_OBJ		1	//直方图对象
#define		GEOGRAPH_PROP_OBJ	    2	//概率图对象
#define		GEOGRAPH_LOCM_OBJ		3	//位置图对象
#define		GEOGRAPH_NQQP_OBJ	    4	//正态QQ图对象
#define		GEOGRAPH_QQPP_OBJ		5	//普通QQ图对象
#define		GEOGRAPH_SCAT_OBJ		6	//散点图对象
#define     GEOGRAPH_VARM_OBJ       7   //变差函数图
#define     GEOGRAPH_CROS_OBJ       8   //交叉验证图
#define     GEOGRAPH_MVARM_OBJ      9   //多个变差函数图
#define     GEOGRAPH_VRGCLD_OBJ     10  //变差函数云图
#define     GEOGRAPH_VRGLOC_OBJ     11  //变差函数云图中位置图


#ifndef MAXLAYERNUM
#define MAXLAYERNUM 256
#endif

typedef struct tagHeightInfoStrcT //高程信息.
{
	float ZMin;
	float ZMax;
	//以后可扩充...
}HeightInfoStrcT;

#ifndef HIGHTLAYER_DEFINED
#define HIGHTLAYER_DEFINED

typedef struct tagHeightLayer     //高程单层信息.
{
	float    MinValue; //下限.
	float    MaxValue; //上限.
}HeightLayer;
#endif

typedef struct tagRGBLutStrcTEx  //高彩色.
{
	WORD r;     //红色通道
	WORD g;     //绿色通道
	WORD b;     //蓝色通道
}RGBLutStrcTEx;

typedef struct tagHeightLayerInfo //高程分层信息.
{
	char          ClrLutName[128];         //彩色查找表名.
	HeightLayer   LayerInfo[MAXLAYERNUM];  //高程分层范围.
	RGBLutStrcTEx ColorTable[MAXLAYERNUM]; //颜色表.
	short         LayerNum;                //高程分层数.
}HeightLayerInfo;

#ifndef _CGEO_3DSTAT_GRAPH
  #define GEOSTAT_GRAPH_DLL  __declspec(dllimport)
#else
  #define GEOSTAT_GRAPH_DLL  __declspec(dllexport)
#endif
    //==============================================公共函数=================================================//	
	//================================================================================
    // 函 数 名：_gsCreateGsGraphObj
    // 功能描述：根据类型的不同创建不同的对象
	// 输入参数：lObjType           ： 对象类型
    // 返回值  ：GeoStatGraphObj    ： 对象指针
    // 创建日期：2007-05-16
    // 修改日期：2008-10-11
    // 附加说明：
    //================================================================================ 
	GeoStatGraphObj GEOSTAT_GRAPH_DLL _gsCreateGsGraphObj(long lObjType);

	//================================================================================
    // 函 数 名：_gsDeleteGsGraphObj
    // 功能描述：删除绘图对象
	// 输入参数：gsObj              ： 绘图对象
    // 返回值  ：无		        							
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	void GEOSTAT_GRAPH_DLL _gsDeleteGsGraphObj(GeoStatGraphObj gsObj);

	//================================================================================
    // 函 数 名：_gsGraphLoadDiscPnts
    // 功能描述：该函数装入的数据,即是各类地质统计绘图功能中处理的数据. 
	// 输入参数：gsObj              ： 绘图对象
	//           pDiscPnts          ： 数据点
	//           lDatNum            ： 数据数目
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2008-10-11
    // 附加说明：
    //================================================================================
    long GEOSTAT_GRAPH_DLL _gsGraphLoadDiscPnts(GeoStatGraphObj gsObj, GsDiscPnt *pDiscPnts, long lDatNum);

	//================================================================================
    // 函 数 名：_gsGraphLoadDiscPnts2
    // 功能描述：该函数装入的第二变量数据,即是各类地质统计绘图功能中处理的数据. 
	// 输入参数：gsObj              ： 绘图对象
	//           pDiscPnts          ： 数据点
	//           lDatNum            ： 数据数目
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2008-10-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphLoadDiscPnts2(GeoStatGraphObj gsObj, GsDiscPnt *pDiscPnts2, long lDatNum2);

	//================================================================================
    // 函 数 名：_gsGraphLoadLocPnts
    // 功能描述：该函数装入的第二变量数据,即是各类地质统计绘图功能中处理的数据. 
	// 输入参数：gsObj              ： 绘图对象
	//           pXPnt              ： 数据点X坐标
	//           pYPnt              ： 数据点Y坐标
	//           lDatNum            ： 数据数目
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2008-10-11
    // 修改日期：2008-10-11
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphLoadLocPnts(GeoStatGraphObj gsObj, double *pXPnt, double *pYPnt, long lDatNum);
	
	//================================================================================
    // 函 数 名：_gsGraphSetAxiName
    // 功能描述：该函数输入各图形x,y轴向的名称
	// 输入参数：gsObj              ： 绘图对象
	//           xAxiName           ： X轴向坐标名称
	//           yAxiName           ： y轴向坐标名称
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphSetAxiName(GeoStatGraphObj gsObj, CString xAxiName, CString yAxiName);
	
	//================================================================================
    // 函 数 名：_gsGraphSetDataExtr
    // 功能描述：该函数设置的数据极限值,即是有效数据的范围. 对数据进行处理时,
	//		     超出该范围的数据将作为无效数据舍弃.
	// 输入参数：gsObj              ： 绘图对象
	//           fExtrMin           ： 数据最小极限
	//           fExtrMax           ： 数据最大极限
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphSetDataExtr(GeoStatGraphObj gsObj, double fExtrMin=GS_MINTRIM, double fExtrMax=GS_MAXTRIM);

	//================================================================================
    // 函 数 名：_gsGraphSetDataExtr2
    // 功能描述：该函数设置的第二变量数据极限值,即是有效数据的范围. 对数据进行处理时,
	//		     超出该范围的数据将作为无效数据舍弃.
	// 输入参数：gsObj              ： 绘图对象
	//           fExtrMin2          ： 数据最小极限
	//           fExtrMax2          ： 数据最大极限
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphSetDataExtr2(GeoStatGraphObj gsObj, double fExtrMin2=GS_MINTRIM, double fExtrMax2=GS_MAXTRIM);
    //==============================================公共函数=================================================//

	//==============================================直方图绘制函数=================================================//

	//================================================================================
    // 函 数 名：_gsGraphSetHistNum
    // 功能描述：该函数设置直方图显示的块个数
	// 输入参数：gsObj              ： 绘图对象
	//           lClassNum          ： 分块数
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphSetHistNum(GeoStatGraphObj gsObj,long lClassNum);

	//================================================================================
    // 函 数 名：_gsGraphSetHistType
    // 功能描述：该函数设置直方图显示类型
	// 输入参数：gsObj              ： 绘图对象
	//           lHistType          ： 直方图类型 0为统计直方图 1为累积概率直方图
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphSetHistType(GeoStatGraphObj gsObj, int lHistType);

	//================================================================================
    // 函 数 名：_gsGraphCptHistParam
    // 功能描述：该函数传出进行直方图统计后的一些结果
	// 输入参数：gsObj              ： 绘图对象
	// 输出参数：lVarDatNum　　　　 ： 有效数据个数　
	//           InVarNum           ： 缺失数据个数
	//           fDatMean           ： 数据平均值
	//           fStdDev            ： 数据标准方差
	//           fDatMax            ： 数据标准方差
	//           xuqt               ： 数据四分之三分位数
	//           xmed               ： 数据中值
	//           xlqt               ： 数据四分之一分位数
	//           fDatMin            ： 数据最小值
	//           fAlter             ： 变差系数
	//           fApex              ： 峰度
	//           fDeflect           ： 偏度
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphCptHistParam(GeoStatGraphObj gsObj, long &lVarDatNum, long &InVarNum,
								      	 double &fDatMean, double &fStdDev, double &fDatMax, double &xuqt,
									     double &xmed, double &xlqt, double &fDatMin, double &fAlter, 
									     double &fApex, double &fDeflect);
	//================================================================================
	// 函 数 名：_gsGraphOutPutHistPntNum
	// 功能描述：调用该函数用来输出直方图中绘制点个数
	// 输入参数：gsObj              ： 绘图对象
	//           lHistPntNum        ： 直方图绘制点个数
	// 返回值  ：1/0		        ： 成功/失败
	// 创建日期：2009-01-05
	// 修改日期：2009-01-05
	// 附加说明：
	//================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphOutPutHistPntNum(GeoStatGraphObj gsObj, long &lHistPntNum);
	
	//================================================================================
	// 函 数 名：_gsGraphOutPutHistPnt
	// 功能描述：调用该函数用来输出直方图中绘制点
	// 输入参数：gsObj              ： 绘图对象
	//           pHistPntX          ： 直方图中X坐标点
	//           pHistPntY          ： 直方图中Y坐标点
	// 返回值  ：1/0		        ： 成功/失败
	// 创建日期：2009-01-05
	// 修改日期：2009-01-05
	// 附加说明：
	//================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphOutPutHistPnt(GeoStatGraphObj gsObj, double *pHistPntX, double *pHistPntY);

	//================================================================================
    // 函 数 名：_gsGraphDrawHistPlt
    // 功能描述：调用该函数用来绘制直方图
	// 输入参数：gsObj              ： 绘图对象
	//           pWndDraw           ： 绘图控件指针
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphDrawHistPlt(GeoStatGraphObj gsObj, CWnd *pWndDraw);
    //==============================================直方图绘制函数=================================================//
    
	//============================================正态概率图绘制函数===============================================//
	//================================================================================
    // 函 数 名：_gsGraphCptPropParam
    // 功能描述：//计算概率图绘制参数
	// 输入参数：gsObj              ： 绘图对象
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	//计算概率图绘制参数
	long GEOSTAT_GRAPH_DLL _gsGraphCptPropParam(GeoStatGraphObj gsObj);

	//================================================================================
	// 函 数 名：_gsGraphOutPutPropPntNum
	// 功能描述：调用该函数用来输出概率图中绘制点个数
	// 输入参数：gsObj              ： 绘图对象
	//           lPropPntNum        ： 概率图绘制点个数
	// 返回值  ：1/0		        ： 成功/失败
	// 创建日期：2009-01-05
	// 修改日期：2009-01-05
	// 附加说明：
	//================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphOutPutPropPntNum(GeoStatGraphObj gsObj, long &lPropPntNum);

	//================================================================================
	// 函 数 名：_gsGraphOutPutPropPnt
	// 功能描述：调用该函数用来输出概率图中绘制点
	// 输入参数：gsObj              ： 绘图对象
	//           pPropPntX          ： 概率图中X坐标点
	//           pPropPntY          ： 概率图中Y坐标点
	// 返回值  ：1/0		        ： 成功/失败
	// 创建日期：2009-01-05
	// 修改日期：2009-01-05
	// 附加说明：
	//================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphOutPutPropPnt(GeoStatGraphObj gsObj, double *pPropAxis, double *pPropPntX, double *pPropPntY);	

	//================================================================================
    // 函 数 名：_gsGraphDrawPropPlt
    // 功能描述：调用该函数用来绘制概率图
	// 输入参数：gsObj              ： 绘图对象
	//           pWndDraw           ： 绘图控件指针
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================	
	long GEOSTAT_GRAPH_DLL _gsGraphDrawPropPlt(GeoStatGraphObj gsObj, CWnd *pWndDraw);
    //====================================== =====正态概率图绘制函数===============================================//

	//==============================================位置图绘制函数=================================================//
	//================================================================================
    // 函 数 名：_gsGraphSetDataExtrMode
    // 功能描述：该函数用来设置对大于极大值和小于极小值的数据的处理情况
	// 输入参数：gsObj              ： 绘图对象
	//           bExtrModeMax       ： 0为替换，1为去除
	//           bExtrModeMin       ： 0为替换，1为去除
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
//	long GEOSTAT_GRAPH_DLL _gsGraphSetDataExtrMode(GeoStatGraphObj gsObj, BOOL bExtrModeMax, BOOL bExtrModeMin);	

	//================================================================================
    // 函 数 名：_gsGraphSetReplaceData
    // 功能描述：该函数用来设置数据进行替换的值
	// 输入参数：gsObj              ： 绘图对象
	//           fReplaceMax        ： 数据替换值
	//           fReplaceMin        ： 数据替换值
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
//	long GEOSTAT_GRAPH_DLL _gsGraphSetReplaceData(GeoStatGraphObj gsObj, double fReplaceMax, double fReplaceMin);
	
	//================================================================================
    // 函 数 名：_gsGraphSetCurPlane
    // 功能描述：该函数用来设置显示平面
	// 输入参数：gsObj              ： 绘图对象
	//           icurPlane          ： 显示平面 0为XY平面，1为XZ平面，2为YZ平面
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	//设置显示平面
	//说明: 该函数用来设置显示平面
	//参数
	//      icurPlane ----------------> 显示平面 0为XY平面，1为XZ平面，2为YZ平面
	long GEOSTAT_GRAPH_DLL _gsGraphSetCurPlane(GeoStatGraphObj gsObj, int icurPlane);
	
	//================================================================================
    // 函 数 名：_gsGraphSetCoordExtr
    // 功能描述：该函数用来设置显示位置图的空间区域大小
	// 输入参数：gsObj              ： 绘图对象
	//           dMin               ： XYZ轴的最小值
	//           dMax               ： XYZ轴的最大值
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
    long GEOSTAT_GRAPH_DLL _gsGraphSetCoordExtr(GeoStatGraphObj gsObj, GSD_3DOT dMin, GSD_3DOT dMax);
	
	//================================================================================
    // 函 数 名：_gsGraphCptLocmParam
    // 功能描述：该函数用来计算位置图显示所需要的参数
	// 输入参数：gsObj              ： 绘图对象
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphCptLocmParam(GeoStatGraphObj gsObj);	

	//================================================================================
    // 函 数 名：_gsGraphDrawLocmPlt
    // 功能描述：调用该函数用来绘制位置图
	// 输入参数：gsObj              ： 绘图对象
	//           pWndDraw           ： 绘制位置图控件指针
	//           grad_pWndDraw      ： 绘制色表控件指针
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphDrawLocmPlt(GeoStatGraphObj gsObj, CWnd *pWndDraw, CWnd *grad_pWndDraw);
	//==============================================位置图绘制函数=================================================//

	//=============================================正态QQ图绘制函数================================================//
	//================================================================================
    // 函 数 名：_gsGraphSetNqqpType
    // 功能描述：该函数设置正态QQ图类型
	// 输入参数：gsObj              ： 绘图对象
	//           nNqqpType          ： 0为正态QQ图，1为正态PP图
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
    long GEOSTAT_GRAPH_DLL _gsGraphSetNqqpType(GeoStatGraphObj gsObj, long nNqqpType);

	//================================================================================
    // 函 数 名：_gsGraphCptNqqpParam
    // 功能描述：该函数用来计算QQ图显示所需要的参数
	// 输入参数：gsObj              ： 绘图对象
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphCptNqqpParam(GeoStatGraphObj gsObj);

	//================================================================================
	// 函 数 名：_gsGraphOutPutNqqpPntNum
	// 功能描述：调用该函数用来输出正态qq图中绘制点个数
	// 输入参数：gsObj              ： 绘图对象
	//           lNqqpPntNum        ： 正态qq图绘制点个数
	// 返回值  ：1/0		        ： 成功/失败
	// 创建日期：2009-01-05
	// 修改日期：2009-01-05
	// 附加说明：
	//================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphOutPutNqqpPntNum(GeoStatGraphObj gsObj, long &lNqqpPntNum);

	//================================================================================
	// 函 数 名：_gsGraphOutPutNqqpPnt
	// 功能描述：调用该函数用来输出正态qq图中绘制点
	// 输入参数：gsObj              ： 绘图对象
	//           pNqqpPntX          ： 概率图中X坐标点
	//           pNqqpPntY          ： 概率图中Y坐标点
	// 返回值  ：1/0		        ： 成功/失败
	// 创建日期：2009-01-05
	// 修改日期：2009-01-05
	// 附加说明：
	//================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphOutPutNqqpPnt(GeoStatGraphObj gsObj, double *pNqqpPntX, double *pNqqpPntY);

	//================================================================================
    // 函 数 名：_gsGraphDrawNqqpPlt
    // 功能描述：调用该函数用来绘制正态QQ图
	// 输入参数：gsObj              ： 绘图对象
	//           pWndDraw           ： 绘制正态QQ图控件指针
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphDrawNqqpPlt(GeoStatGraphObj gsObj, CWnd *pWndDraw);

    //=============================================正态QQ图绘制函数================================================//
	//===============================================QQ图绘制函数==================================================//
	//================================================================================
    // 函 数 名：_gsGraphSetQqppType
    // 功能描述：该函数设置QQ图类型
	// 输入参数：gsObj              ： 绘图对象
	//           nQqppType          ： 0为QQ图，1为PP图
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
    long GEOSTAT_GRAPH_DLL _gsGraphSetQqppType(GeoStatGraphObj gsObj, long nQqppType);
	
	//================================================================================
    // 函 数 名：_gsGraphCptQqppParam
    // 功能描述：该函数传出进行QQ图统计后的一些结果
	// 输入参数：gsObj              ： 绘图对象
	// 输出参数：lVarDatNumX        ： X有效数据个数
	//           fDatMeanX          ： X数据平均值
	//           fStdDevX           ： X数据标准方差
	//           lVarDatNumY        ： X数据平均值
	//           fDatMeanY          ： X数据平均值
	//           fStdDevY           ： X数据平均值
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
    long GEOSTAT_GRAPH_DLL _gsGraphCptQqppParam(GeoStatGraphObj gsObj, long &lValDatNumX, double &fDatMeanX, double &fStdDevX,
							long &lValDatNumY, double &fDatMeanY, double &fStdDevY);

	//================================================================================
    // 函 数 名：_gsGraphDrawQqppPlt
    // 功能描述：调用该函数用来绘制QQ图
	// 输入参数：gsObj              ： 绘图对象
	//           pWndDraw           ： 绘制QQ图控件指针
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphDrawQqppPlt(GeoStatGraphObj gsObj, CWnd *pWndDraw);
    //===============================================QQ图绘制函数==================================================//
	
    //==============================================散点图绘制函数=================================================//
	//================================================================================
    // 函 数 名：_gsGraphCptScatParam
    // 功能描述：该函数传出散点图相关变量
	// 输入参数：gsObj              ： 绘图对象
	// 输出参数：fRankCorr          ： 等级系数
	//           lVarDatNumX        ： X有效数据个数
	//           fDatMeanX          ： X数据平均值
	//           fStdDevX           ： X数据标准方差
	//           lVarDatNumY        ： Y有效数据个数
	//           fDatMeanY          ： Y数据平均值
	//           fStdDevY           ： Y数据标准方差
	//           fCorrCoef          ： 相关系数
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphCptScatParam(GeoStatGraphObj gsObj, double &fRankCorr, long &lValDatNumX, double &fDatMeanX, double &fStdDevX, 
								  long &lValDatNumY, double &fDatMeanY, double &fStdDevY, double &fCorrCoef);

	//================================================================================
    // 函 数 名：_gsGraphDrawScatPlt
    // 功能描述：调用该函数用来绘制散点图
	// 输入参数：gsObj              ： 绘图对象
	//           pWndDraw           ： 绘制散点图控件指针
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphDrawScatPlt(GeoStatGraphObj gsObj, CWnd *pWndDraw);	
	//==============================================散点图绘制函数=================================================//

	//============================================变差函数图绘制函数===============================================//
	//================================================================================
    // 函 数 名：_gsGraphLoadVarmData
    // 功能描述：该函数用来装入绘制变差函数图所用到的变量
	// 输入参数：gsObj              ： 绘图对象
	//           pVrgResult         ： 变差函数点
	//           pVrgModInd         ： 变差函数拟合点
	//           pVrgPnt            ： 变差函数绘图点
	//           pVrgPntSel         ： 变差函数点删除标志(1删除，0没有删除)
	//           lVrgNlag           ： 变差函数点个数
	//           IsShowFitVrg       ： 是否显示拟合图形
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
    long GEOSTAT_GRAPH_DLL _gsGraphLoadVarmData(GeoStatGraphObj gsObj, Variogram *pVrgResult, 
	                              ModIndVrg *pVrgModInd, CPoint *pVrgPnt, BOOL *pVrgPntSel, long lVrgNlag, BOOL IsShowFitVrg = TRUE);

	//================================================================================
    // 函 数 名：_gsGraphSetVrgNug
    // 功能描述：该函数用来设置变差函数拟合图形的块金值
	// 输入参数：gsObj              ： 绘图对象
	//           fVrgNug　          ： 块金值
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphSetVrgNug(GeoStatGraphObj gsObj, double fVrgNug);
	
	//================================================================================
    // 函 数 名：_gsGraphSetIsDspLine
    // 功能描述：该函数用来设置是否显示实验变差函数连线
	// 输入参数：gsObj              ： 绘图对象
	//           IsDspLine          ： TRUE 显示连线，FLASE 不显示连线
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphSetIsDspLine(GeoStatGraphObj gsObj, BOOL IsDspLine);
	
	//================================================================================
    // 函 数 名：_gsGraphSetIsDspSill
    // 功能描述：该函数用来设置是否显示变量方差
	// 输入参数：gsObj              ： 绘图对象
	//           IsDspSill          ： TRUE 显示连线，FLASE 不显示连线
	//           fSill              ： 变量方差
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
    long GEOSTAT_GRAPH_DLL _gsGraphSetIsDspSill(GeoStatGraphObj gsObj, BOOL IsDspSill, double fSill);	
	
	//================================================================================
    // 函 数 名：_gsGraphSetCutOffNO
    // 功能描述：该函数用来设置总共的阈值个数和当前显示的阈值号
	// 输入参数：gsObj              ： 绘图对象
	//           iCutOffNum         ： 阈值个数(普通克里格为1)
	//           iCutOffNO          ： 当前阈值号
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphSetCutOffNO(GeoStatGraphObj gsObj, int iCutOffNum, int iCutOffNO);
    
	//================================================================================
    // 函 数 名：_gsGraphSetColor
    // 功能描述：该函数用来设置图形的颜色
	// 输入参数：gsObj              ： 绘图对象
	//           expVrgColor        ： 实验变差函数颜色
	//           fitVrgColor        ： 拟合后的理论变差函数图形颜色
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphSetColor(GeoStatGraphObj gsObj, COLORREF expVrgColor, COLORREF fitVrgColor);
	
	//================================================================================
    // 函 数 名：_gsGraphDrawVarmPlt
    // 功能描述：该函数用来绘制实验变差函数点和理论变差函数
	// 输入参数：gsObj              ： 绘图对象
	//           pWndDraw           ： 绘制图形控件指针
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphDrawVarmPlt(GeoStatGraphObj gsObj, CWnd *pWndDraw);
	
	//================================================================================
    // 函 数 名：_gsGraphDrawVrgLine
    // 功能描述：该函数用来绘制实验变差函数点的连线
	// 输入参数：gsObj              ： 绘图对象
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphDrawVrgLine(GeoStatGraphObj gsObj);
	
	//================================================================================
    // 函 数 名：_gsGraphDrawSelectPoint
    // 功能描述：该函数用来绘制删除图形选中的点
	// 输入参数：gsObj              ： 绘图对象
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	//绘制点
	//说明: 该函数用来绘制删除图形选中的点
	long GEOSTAT_GRAPH_DLL _gsGraphDrawSelectPoint(GeoStatGraphObj gsObj);

	//================================================================================
    // 函 数 名：_gsGraphGetAxisRange
    // 功能描述：该函数用来读取绘制图形中坐标轴的范围
	// 输入参数：gsObj              ： 绘图对象
	// 输出参数：dxMin              ： x轴最小值
	//           dxMax              ： x轴最大值
	//           dyMin              ： y轴最小值
	//           dyMax              ： y轴最大值
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2009-03-13
    // 修改日期：2009-03-13
    // 附加说明：该函数只能在绘图完毕后调用
    //================================================================================
	//绘制点
	//说明: 该函数用来绘制删除图形选中的点
	long GEOSTAT_GRAPH_DLL _gsGraphGetAxisRange(GeoStatGraphObj gsObj, double &dxMin, double &dxMax, double &dyMin, double &dyMax);
    //============================================变差函数图绘制函数===============================================//
	
	//==========================================多个变差函数图绘制函数=============================================//
	//================================================================================
    // 函 数 名：_gsGraphLoadMVarmData
    // 功能描述：该函数用来装入绘制变差函数图所用到的变量
	// 输入参数：gsObj              ： 绘图对象
	//           pVrgResult         ： 变差函数点
	//           pVrgModInd         ： 变差函数拟合点
	//           pVrgPnt            ： 变差函数绘图点
	//           pVrgPntSel         ： 变差函数点删除标志(1删除，0没有删除)
	//           lVrgNlag           ： 变差函数点个数
	//           IsShowFitVrg       ： 是否显示拟合图形
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
    long GEOSTAT_GRAPH_DLL _gsGraphLoadMVarmData(GeoStatGraphObj gsObj, Variogram *pVrgResult[],
		               long lVrgNlag[], CPoint *pVrgPnt[], long lVrgNum, BOOL bSelect[], BOOL IsShowFitVrg = TRUE);
 	
	//================================================================================
    // 函 数 名：_gsGraphSetMVrgNug
    // 功能描述：该函数用来设置变差函数拟合图形的块金值
	// 输入参数：gsObj              ： 绘图对象
	//           fVrgNug            ： 块金值
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphSetMVrgNug(GeoStatGraphObj gsObj, double fVrgNug);
	
	//================================================================================
    // 函 数 名：_gsGraphSetMIsDspLine
    // 功能描述：该函数用来设置是否显示实验变差函数连线
	// 输入参数：gsObj              ： 绘图对象
	//           IsDspLine          ： TRUE 显示连线，FLASE 不显示连线
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphSetMIsDspLine(GeoStatGraphObj gsObj, BOOL IsDspLine);
	
	//================================================================================
    // 函 数 名：_gsGraphSetMIsDspSill
    // 功能描述：该函数用来设置是否显示变量方差
	// 输入参数：gsObj              ： 绘图对象
	//           IsDspSill          ： TRUE 显示连线，FLASE 不显示连线
	//           fSill              ： 变量方差
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
    long GEOSTAT_GRAPH_DLL _gsGraphSetMIsDspSill(GeoStatGraphObj gsObj, BOOL IsDspSill, double fSill);	
	
	//================================================================================
    // 函 数 名：_gsGraphSetMCutOffNO
    // 功能描述：该函数用来设置总共的阈值个数和当前显示的阈值号
	// 输入参数：gsObj              ： 绘图对象
	//           iCutOffNum         ： 阈值个数(普通克里格为1)
	//           iCutOffNO          ： 当前阈值号
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphSetMCutOffNO(GeoStatGraphObj gsObj, int iCutOffNum, int iCutOffNO);
	
	//================================================================================
    // 函 数 名：_gsGraphSetMColor
    // 功能描述：该函数用来设置图形的颜色
	// 输入参数：gsObj              ： 绘图对象
	//           expVrgColor        ： 实验变差函数颜色
	//           fitVrgColor        ： 拟合后的理论变差函数图形颜色
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphSetMColor(GeoStatGraphObj gsObj, COLORREF *expVrgColor, COLORREF *fitVrgColor);
	
	//================================================================================
    // 函 数 名：_gsGraphDrawMVarmPlt
    // 功能描述：该函数用来绘制实验变差函数点和理论变差函数
	// 输入参数：gsObj              ： 绘图对象
	//           pWndDraw           ： 绘制图形控件指针
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphDrawMVarmPlt(GeoStatGraphObj gsObj, CWnd *pWndDraw);

	//================================================================================
    // 函 数 名：_gsGraphDrawMVrgLine
    // 功能描述：该函数用来绘制实验变差函数点的连线
	// 输入参数：gsObj              ： 绘图对象
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphDrawMVrgLine(GeoStatGraphObj gsObj);

	//================================================================================
    // 函 数 名：_gsGraphDrawMSelectPoint
    // 功能描述：该函数用来绘制删除图形选中的点
	// 输入参数：gsObj              ： 绘图对象
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphDrawMSelectPoint(GeoStatGraphObj gsObj);	
	//==========================================多个变差函数图绘制函数=============================================//
	
	//============================================交叉验证图绘制函数===============================================//
	//================================================================================
    // 函 数 名：_gsGraphLoadCrosData
    // 功能描述：该函数用来装入绘制交叉验证图所用到的变量
	// 输入参数：gsObj              ： 绘图对象
	//           pOriVal            ： 原始点
	//           pEstabVal          ： 估值点
	//           lDatNum            ： 点个数
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphLoadCrosData(GeoStatGraphObj gsObj, double *pOriVal, double *pEstabVal, long lDatNum);
    
	//================================================================================
    // 函 数 名：_gsGraphSetFitLine
    // 功能描述：该函数用来设置拟合后的直线的参数y = ax + b;
	// 输入参数：gsObj              ： 绘图对象
	//           a                  ： 拟合系数
	//           b                  ： 偏移
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphSetFitLine(GeoStatGraphObj gsObj, double a, double b);

	//================================================================================
    // 函 数 名：_gsGraphDrawCrosPlt
    // 功能描述：该函数用来绘制交叉验证图形
	// 输入参数：gsObj              ： 绘图对象
	//           pWndDraw           ： 绘图控件指针
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphDrawCrosPlt(GeoStatGraphObj gsObj, CWnd *pWndDraw);
	//============================================交叉验证图绘制函数===============================================//

	//=============================================变差函数云图绘制函数================================================//
	
	//================================================================================
    // 函 数 名：_gsLoadVrgCldSelInfo
    // 功能描述：调用该函数用来导入变差函数云图选中点
	// 输入参数：gsObj              ： 绘图对象
	//           plSelRelation      ： 选中点序号
	//           lSelNum            ： 选中点个数
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2008-10-13
    // 修改日期：2008-10-13
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsLoadVrgCldSelInfo(GeoStatGraphObj gsObj, long *plSelRelation, long lSelNum);
	
	//================================================================================
    // 函 数 名：_gsGraphDrawVrgCldPlt
    // 功能描述：调用该函数用来绘制变差函数云图
	// 输入参数：gsObj              ： 绘图对象
	//           pWndDraw           ： 绘制变差函数云图控件指针
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2008-10-11
    // 修改日期：2008-10-11
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphDrawVrgCldPlt(GeoStatGraphObj gsObj, CWnd *pWndDraw);	
	
	//================================================================================
    // 函 数 名：_gsLoadVrgCldLocSelInfo
    // 功能描述：调用该函数用来导入变差函数云图中位置图选中点
	// 输入参数：gsObj              ： 绘图对象
	//           plSelRelation      ： 选中点序号
	//           lSelNum            ： 选中点个数
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2008-10-13
    // 修改日期：2008-10-13
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsLoadVrgCldLocSelInfo(GeoStatGraphObj gsObj, GSL_DOT *plSelRelation, long lSelNum);

		//================================================================================
    // 函 数 名：_gsGraphDrawVrgCldLocmPlt
    // 功能描述：调用该函数用来绘制变差函数云图中位置图
	// 输入参数：gsObj              ： 绘图对象
	//           pWndDraw           ： 绘制变差函数图中位置图控件指针
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2008-10-11
    // 修改日期：2008-10-11
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsGraphDrawVrgCldLocmPlt(GeoStatGraphObj gsObj, CWnd *pWndDraw);	

	long GEOSTAT_GRAPH_DLL _gsGraphWorldtoScreen(GeoStatGraphObj gsObj, double x, double y, int &xDes, int &yDes);

	//=============================================变差函数云图绘制函数================================================//


	//=================================================工具函数====================================================//

	//================================================================================
    // 函 数 名：_gsTranNcore
    // 功能描述：该函数可以用来对绘图函数中用到的变量进行正态变换
	// 输入参数：gsObj              ： 绘图对象
	//           pDiscPnts          ： 进行正态变换的变量
	//           lDatNum            ： 变量个数
	//           fMax               ： 正态变换前的数据属性的最大值
	//           fMin               ： 正态变换前的数据属性的最小值
	// 输出参数：fTranMax           ： 正态变换后的数据属性的最大值
	//           fTranMin           ： 正态变换后的数据属性的最小值
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsTranNcore(GsDiscPnt *pDiscPnts, long lDatNum, double fMax, double fMin, double &fTranMax, double &fTranMin);
	
	//================================================================================
    // 函 数 名：_gsTranLog
    // 功能描述：该函数可以用来对绘图函数中用到的变量进行对数变换
	// 输入参数：gsObj              ： 绘图对象
	//           pDiscPnts          ： 进行对数变换的变量
	//           lDatNum            ： 变量个数
	//           fMax               ： 对数变换前的数据属性的最大值
	//           fMin               ： 对数变换前的数据属性的最小值
	// 输出参数：fTranMax           ： 对数变换后的数据属性的最大值
	//           fTranMin           ： 对数变换后的数据属性的最小值
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-05-16
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsTranLog(GsDiscPnt *pDiscPnts, long lDatNum, double fMax, double fMin, double fLogExcu, double &fTranMax, double &fTranMin);
    
	//================================================================================
    // 函 数 名：_gsCptVModel
    // 功能描述：该函数可以将拟合好的理论变差函数模型转换为理论变差函数点
	// 输入参数：gsObj              ： 绘图对象
	//           kVrgModel          ： 理论变差函数模型参数
	//           iLagSize           ： 步长间距
	//           nLagNum            ： 步长数目
	//           iVrgType           ： 变差函数类型0变差函数，1协方差函数
	// 输出参数：pVrgModInd         ： 理论变差函数点
    // 返回值  ：1/0		        ： 成功/失败
    // 创建日期：2007-05-16
    // 修改日期：2007-09-04
    // 附加说明：
    //================================================================================
	long GEOSTAT_GRAPH_DLL _gsCptVModel(Kt3dIntp kVrgModel, double iLagSize, int nLagNum, int iVrgType, ModIndVrg *pVrgModInd);
	//=================================================工具函数====================================================//
#if defined(__cplusplus)
  extern "C" {
#endif 


#ifdef __cplusplus
 }
#endif

#ifndef _CGEO_3DSTAT_GRAPH
	#ifdef _DEBUG
		#pragma comment(lib, "GeoStatGraphLibD.lib")
	#else
		#pragma comment(lib, "GeoStatGraphLib.lib")
	#endif
#endif


#endif //_GEOSTAT_LIB_H	  